### Importing module

In [31]:

import mysql.connector as connector
from mysql.connector import Error

### Create a cursor

In [17]:
try:
    connection = connector.connect(user='root',password='root@123')
    cursor = connection.cursor()
except Error as e:
    print("Error No: ",e.errno)
    print("Error Message: ",e.msg)

In [18]:
#create database little_lemon_db
cursor.execute("DROP DATABASE IF EXISTS little_lemon_db")
cursor.execute("CREATE DATABASE IF NOT EXISTS little_lemon_db")

In [19]:
#set it for use
cursor.execute("USE little_lemon_db")

In [21]:
#MenuItems table
create_menuitem_table = """CREATE TABLE IF NOT EXISTS MenuItems (
ItemID INT AUTO_INCREMENT,
Name VARCHAR(200),
Type VARCHAR(100),
Price INT,
PRIMARY KEY (ItemID)
);"""
cursor.execute(create_menuitem_table)

create_menu_table = """CREATE TABLE IF NOT EXISTS Menus (
MenuID INT,
ItemID INT,
Cuisine VARCHAR(100),
PRIMARY KEY (MenuID,ItemID)
);"""
cursor.execute(create_menu_table)

create_booking_table = """CREATE TABLE IF NOT EXISTS Bookings (
BookingID INT AUTO_INCREMENT,
TableNo INT,
GuestFirstName VARCHAR(100) NOT NULL,
GuestLastName VARCHAR(100) NOT NULL,
BookingSlot TIME NOT NULL,
EmployeeID INT,
PRIMARY KEY (BookingID)
);"""
cursor.execute(create_booking_table)

create_orders_table = """CREATE TABLE IF NOT EXISTS Orders (
OrderID INT,
TableNo INT,
MenuID INT,
BookingID INT,
BillAmount INT,
Quantity INT,
PRIMARY KEY (OrderID,TableNo)
);"""
cursor.execute(create_orders_table)

create_employees_table = """CREATE TABLE IF NOT EXISTS Employees (
EmployeeID INT AUTO_INCREMENT PRIMARY KEY,
Name VARCHAR(255),
Role VARCHAR(255),
Address VARCHAR(255),
Contact_Number INT,
Email VARCHAR(50),
Annual_Salary VARCHAR(10)
);"""
cursor.execute(create_employees_table)

In [24]:
#*******************************************************#
# Insert query to populate "MenuItems" table:
#*******************************************************#
insert_menuitems="""
INSERT INTO MenuItems (ItemID, Name, Type, Price)
VALUES
(1, 'Olives','Starters',5),
(2, 'Flatbread','Starters', 5),
(3, 'Minestrone', 'Starters', 8),
(4, 'Tomato bread','Starters', 8),
(5, 'Falafel', 'Starters', 7),
(6, 'Hummus', 'Starters', 5),
(7, 'Greek salad', 'Main Courses', 15),
(8, 'Bean soup', 'Main Courses', 12),
(9, 'Pizza', 'Main Courses', 15),
(10, 'Greek yoghurt','Desserts', 7),
(11, 'Ice cream', 'Desserts', 6),
(12, 'Cheesecake', 'Desserts', 4),
(13, 'Athens White wine', 'Drinks', 25),
(14, 'Corfu Red Wine', 'Drinks', 30),
(15, 'Turkish Coffee', 'Drinks', 10),
(16, 'Turkish Coffee', 'Drinks', 10),
(17, 'Kabasa', 'Main Courses', 17);"""

#*******************************************************#
# Insert query to populate "Menu" table:
#*******************************************************#
insert_menu="""
INSERT INTO Menus (MenuID,ItemID,Cuisine)
VALUES
(1, 1, 'Greek'),
(1, 7, 'Greek'),
(1, 10, 'Greek'),
(1, 13, 'Greek'),
(2, 3, 'Italian'),
(2, 9, 'Italian'),
(2, 12, 'Italian'),
(2, 15, 'Italian'),
(3, 5, 'Turkish'),
(3, 17, 'Turkish'),
(3, 11, 'Turkish'),
(3, 16, 'Turkish');"""

#*******************************************************#
# Insert query to populate "Bookings" table:
#*******************************************************#
insert_bookings="""
INSERT INTO Bookings (BookingID, TableNo, GuestFirstName, 
GuestLastName, BookingSlot, EmployeeID)
VALUES
(1, 12, 'Anna','Iversen','19:00:00',1),
(2, 12, 'Joakim', 'Iversen', '19:00:00', 1),
(3, 19, 'Vanessa', 'McCarthy', '15:00:00', 3),
(4, 15, 'Marcos', 'Romero', '17:30:00', 4),
(5, 5, 'Hiroki', 'Yamane', '18:30:00', 2),
(6, 8, 'Diana', 'Pinto', '20:00:00', 5);"""

#*******************************************************#
# Insert query to populate "Orders" table:
#*******************************************************#
insert_orders="""
INSERT INTO Orders (OrderID, TableNo, MenuID, BookingID, Quantity, BillAmount)
VALUES
(1, 12, 1, 1, 2, 86),
(2, 19, 2, 2, 1, 37),
(3, 15, 2, 3, 1, 37),
(4, 5, 3, 4, 1, 40),
(5, 8, 1, 5, 1, 43);"""

#*******************************************************#
# Insert query to populate "Employees" table:
#*******************************************************#
insert_employees = """
INSERT INTO employees (EmployeeID, Name, Role, Address, Contact_Number, Email, Annual_Salary) VALUES
(01,'Mario Gollini','Manager','724, Parsley Lane, Old Town, Chicago, IL',351258074,'Mario.g@littlelemon.com','$70,000'),
(02,'Adrian Gollini','Assistant Manager','334, Dill Square, Lincoln Park, Chicago, IL',351474048,'Adrian.g@littlelemon.com','$65,000'),
(03,'Giorgos Dioudis','Head Chef','879 Sage Street, West Loop, Chicago, IL',351970582,'Giorgos.d@littlelemon.com','$50,000'),
(04,'Fatma Kaya','Assistant Chef','132  Bay Lane, Chicago, IL',351963569,'Fatma.k@littlelemon.com','$45,000'),
(05,'Elena Salvai','Head Waiter','989 Thyme Square, EdgeWater, Chicago, IL',351074198,'Elena.s@littlelemon.com','$40,000'),
(06,'John Millar','Receptionist','245 Dill Square, Lincoln Park, Chicago, IL',351584508,'John.m@littlelemon.com','$35,000');"""

In [ ]:
# Populate MenuItems table
cursor.execute(insert_menuitems)
connection.commit()

# Populate MenuItems table
cursor.execute(insert_menu)
connection.commit()

# Populate Bookings table
cursor.execute(insert_bookings)
connection.commit()

# Populate Orders table
cursor.execute(insert_orders)
connection.commit()

# Populate Employees table
cursor.execute(insert_employees)
connection.commit()

# Populate Employees table
cursor.execute(insert_employees)
connection.commit()

In [26]:
#Establish a connection by importing MySQLConnectionPool and creating a pool with two connections.
from mysql.connector.pooling import MySQLConnectionPool

In [35]:
#config file
dbconfig={"database":"little_lemon_db", "user":"root", "password":"root@123"}
try:
    pool = MySQLConnectionPool(pool_name='pool_a',pool_size=2,**dbconfig)
    print("The pool is created with the name: ",pool.pool_name)
    print("The pool size is: ",pool.pool_size)
except Error as e:
    print("Error No:",e.errno)
    print("Error Message: ",e.msg)

The pool is created with the name:  pool_a
The pool size is:  2

In [36]:
#connection one
connection1 = pool.get_connection()
connection2 = pool.get_connection()

In [39]:
cursor1 = connection1.cursor()

In [40]:
#Implement a stored procedure called PeakHours
cursor1.execute("DROP PROCEDURE IF EXISTS PeakHours")
peak_hours="""
CREATE PROCEDURE IF NOT EXISTS PeakHours()
BEGIN
select hour(bookingslot) as hour,count(hour(bookingslot)) as no_of_bookings
from bookings
group by hour(BookingSlot)
order by no_of_bookings desc;
END
"""

In [41]:
#execute query
cursor1.execute(peak_hours)
#invoke procedure
cursor1.callproc('PeakHours')
result = next(cursor1.stored_results())
dataset = result.fetchall()

In [43]:
print(result.column_names)
for data in dataset:
    print(data)

('hour', 'no_of_bookings')
(19, 2)
(15, 1)
(17, 1)
(18, 1)
(20, 1)

In [44]:
connection1.close()

In [45]:
cursor2 = connection2.cursor()

In [51]:
#Implement a stored procedure called GuestStatus
cursor2.execute("DROP PROCEDURE IF EXISTS GuestStatus")
guest_status="""
CREATE PROCEDURE IF NOT EXISTS GuestStatus()
BEGIN
select concat(bookings.GuestFirstName,' ',bookings.GuestLastName) as guest_name,
case
	when employees.Role in ('Manager','Assistant Manager') then 'Ready to pay'
    when employees.Role = 'Head Chef' then 'Ready to serve'
	when employees.Role = 'Assistant Chef' then 'Preparing order'
    when employees.Role = 'Head Waiter' then 'Order served'
    else 'unknown'
end as order_status
from bookings
left join employees
on employees.EmployeeID=bookings.BookingID;
END
"""

In [52]:
#execute query
cursor2.execute(guest_status)
#invoke procedure
cursor2.callproc('GuestStatus')
result = next(cursor2.stored_results())
dataset = result.fetchall()

In [53]:
print(result.column_names)
for data in dataset:
    print(data)

('guest_name', 'order_status')
('Anna Iversen', 'Ready to pay')
('Joakim Iversen', 'Ready to pay')
('Vanessa McCarthy', 'Ready to serve')
('Marcos Romero', 'Preparing order')
('Hiroki Yamane', 'Order served')
('Diana Pinto', 'unknown')

In [54]:
connection2.close()